<details>
<summary>Terraform apply log</summary>

```
Terraform will perform the following actions:

  # module.soc_volumes.nomad_csi_volume.tempo_data[0] will be created
  + resource "nomad_csi_volume" "tempo_data" {
      + capacity                = (known after apply)
      + capacity_max            = "2.0 GiB"
      + capacity_max_bytes      = (known after apply)
      + capacity_min            = "1.0 GiB"
      + capacity_min_bytes      = (known after apply)
      + controller_required     = (known after apply)
      + controllers_expected    = (known after apply)
      + controllers_healthy     = (known after apply)
      + external_id             = (known after apply)
      + id                      = (known after apply)
      + name                    = "tempo-data[0]"
      + namespace               = "c3-monitoring"
      + nodes_expected          = (known after apply)
      + nodes_healthy           = (known after apply)
      + plugin_id               = "soc-axion-smb"
      + plugin_provider         = (known after apply)
      + plugin_provider_version = (known after apply)
      + schedulable             = (known after apply)
      + topologies              = (known after apply)
      + volume_id               = "tempo-data[0]"

      + capability {
          + access_mode     = "single-node-writer"
          + attachment_mode = "file-system"
        }

      + mount_options {
          + fs_type     = "cifs"
          + mount_flags = [
              + "vers=3.0",
              + "uid={redacted}",
              + "gid={redacted}",
              + "file_mode=0664",
              + "dir_mode=0775",
              + "noperm",
              + "nobrl",
              + (sensitive value),
              + (sensitive value),
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2024-01-31T21:00:06.792+0100 [DEBUG] command: asking for input: "\nDo you want to perform these actions?"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2024-01-31T21:00:09.216+0100 [INFO]  backend/local: apply calling Apply
2024-01-31T21:00:09.216+0100 [DEBUG] Building and walking apply graph for NormalMode plan
2024-01-31T21:00:09.217+0100 [DEBUG] Resource state not found for node "module.soc_volumes.nomad_csi_volume.tempo_data[0]", instance module.soc_volumes.nomad_csi_volume.tempo_data[0]
2024-01-31T21:00:09.219+0100 [DEBUG] adding implicit provider configuration provider["registry.terraform.io/hashicorp/vault"], implied first by module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand)
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.soc_volumes.nomad_csi_volume.tempo_data (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/nomad"]
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/vault"]
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.intentions.consul_config_entry.tempo_intention (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/consul"]
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.intentions.consul_config_entry.tempo_zipkin_intention (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/consul"]
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.soc_volumes.data.nomad_plugin.storage (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/nomad"]
2024-01-31T21:00:09.219+0100 [DEBUG] ProviderTransformer: "module.soc_volumes.nomad_csi_volume.tempo_data[0]" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/nomad"]
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.var.plugin_id (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.var.cifs_user_id (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.intentions (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes (close)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.intentions.consul_config_entry.tempo_intention (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.intentions.consul_config_entry.tempo_zipkin_intention (expand)" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/nomad\"]" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/vault\"]" references: []
2024-01-31T21:00:09.221+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes (expand)" references: []
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.nomad_csi_volume.tempo_data (expand)" references: [module.soc_volumes.data.nomad_plugin.storage (expand) module.soc_volumes.data.nomad_plugin.storage (expand) module.soc_volumes.var.cifs_user_id (expand) module.soc_volumes.var.cifs_group_id (expand) module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand) module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand)]
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/consul\"]" references: []
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.data.nomad_plugin.storage (expand)" references: [module.soc_volumes.var.plugin_id (expand)]
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.var.cifs_group_id (expand)" references: []
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "module.soc_volumes.nomad_csi_volume.tempo_data[0]" references: [module.soc_volumes.data.nomad_plugin.storage (expand) module.soc_volumes.data.nomad_plugin.storage (expand) module.soc_volumes.var.cifs_user_id (expand) module.soc_volumes.var.cifs_group_id (expand) module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand) module.soc_volumes.data.vault_kv_secret_v2.volume_credentials (expand)]
2024-01-31T21:00:09.222+0100 [DEBUG] ReferenceTransformer: "module.intentions (close)" references: []
2024-01-31T21:00:09.225+0100 [DEBUG] pruneUnusedNodes: module.intentions.consul_config_entry.tempo_intention (expand) is no longer needed, removing
2024-01-31T21:00:09.225+0100 [DEBUG] pruneUnusedNodes: module.intentions.consul_config_entry.tempo_zipkin_intention (expand) is no longer needed, removing
2024-01-31T21:00:09.225+0100 [DEBUG] pruneUnusedNodes: module.intentions (expand) is no longer needed, removing
2024-01-31T21:00:09.225+0100 [DEBUG] pruneUnusedNodes: provider["registry.terraform.io/hashicorp/consul"] is no longer needed, removing
2024-01-31T21:00:09.228+0100 [DEBUG] Starting graph walk: walkApply
2024-01-31T21:00:09.229+0100 [DEBUG] created provider logger: level=debug
2024-01-31T21:00:09.229+0100 [INFO]  provider: configuring client automatic mTLS
2024-01-31T21:00:09.258+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/vault/3.24.0/linux_amd64/terraform-provider-vault_v3.24.0_x5 args=[".terraform/providers/registry.terraform.io/hashicorp/vault/3.24.0/linux_amd64/terraform-provider-vault_v3.24.0_x5"]
2024-01-31T21:00:09.259+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/vault/3.24.0/linux_amd64/terraform-provider-vault_v3.24.0_x5 pid=570881
2024-01-31T21:00:09.259+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/vault/3.24.0/linux_amd64/terraform-provider-vault_v3.24.0_x5
2024-01-31T21:00:09.350+0100 [INFO]  provider.terraform-provider-vault_v3.24.0_x5: configuring server automatic mTLS: timestamp="2024-01-31T21:00:09.349+0100"
2024-01-31T21:00:09.369+0100 [DEBUG] provider: using plugin: version=5
2024-01-31T21:00:09.369+0100 [DEBUG] provider.terraform-provider-vault_v3.24.0_x5: plugin address: address=/tmp/plugin1466548974 network=unix timestamp="2024-01-31T21:00:09.369+0100"
2024-01-31T21:00:09.386+0100 [DEBUG] created provider logger: level=debug
2024-01-31T21:00:09.387+0100 [INFO]  provider: configuring client automatic mTLS
2024-01-31T21:00:09.399+0100 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/vault\"]" changed the config value, but that value is unused
2024-01-31T21:00:09.399+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/nomad/2.1.0/linux_amd64/terraform-provider-nomad_v2.1.0_x5 args=[".terraform/providers/registry.terraform.io/hashicorp/nomad/2.1.0/linux_amd64/terraform-provider-nomad_v2.1.0_x5"]
2024-01-31T21:00:09.399+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/nomad/2.1.0/linux_amd64/terraform-provider-nomad_v2.1.0_x5 pid=570893
2024-01-31T21:00:09.399+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/nomad/2.1.0/linux_amd64/terraform-provider-nomad_v2.1.0_x5
2024-01-31T21:00:09.410+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: configuring server automatic mTLS: timestamp="2024-01-31T21:00:09.410+0100"
2024-01-31T21:00:09.431+0100 [DEBUG] provider: using plugin: version=5
2024-01-31T21:00:09.431+0100 [DEBUG] provider.terraform-provider-nomad_v2.1.0_x5: plugin address: address=/tmp/plugin1420660728 network=unix timestamp="2024-01-31T21:00:09.431+0100"
2024-01-31T21:00:09.452+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-31T21:00:09.458+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/vault/3.24.0/linux_amd64/terraform-provider-vault_v3.24.0_x5 pid=570881
2024-01-31T21:00:09.458+0100 [DEBUG] provider: plugin exited
2024-01-31T21:00:09.468+0100 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/nomad\"]" changed the config value, but that value is unused
2024-01-31T21:00:09.478+0100 [WARN]  Provider "registry.terraform.io/hashicorp/nomad" produced an invalid plan for module.soc_volumes.nomad_csi_volume.tempo_data[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .capacity_max: planned value cty.StringVal("2.0 GiB") does not match config value cty.StringVal("2GiB")
      - .capacity_min: planned value cty.StringVal("1.0 GiB") does not match config value cty.StringVal("1GiB")
module.soc_volumes.nomad_csi_volume.tempo_data[0]: Creating...
2024-01-31T21:00:09.479+0100 [INFO]  Starting apply for module.soc_volumes.nomad_csi_volume.tempo_data[0]
2024-01-31T21:00:09.480+0100 [DEBUG] module.soc_volumes.nomad_csi_volume.tempo_data[0]: applying the planned Create change
2024-01-31T21:00:09.484+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] setting computed for "topologies" from ComputedKeys: timestamp="2024-01-31T21:00:09.484+0100"
2024-01-31T21:00:09.484+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] creating CSI volume "tempo-data[0]" in namespace "": timestamp="2024-01-31T21:00:09.484+0100"
2024-01-31T21:00:09.484+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] Waiting for state to become: [success]: timestamp="2024-01-31T21:00:09.484+0100"
2024-01-31T21:00:09.674+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] CSI volume "tempo-data[0]" created in namespace "": timestamp="2024-01-31T21:00:09.674+0100"
2024-01-31T21:00:09.674+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] reading information for CSI volume "tempo-data[0]" in namespace "c3-monitoring": timestamp="2024-01-31T21:00:09.674+0100"
2024-01-31T21:00:09.686+0100 [INFO]  provider.terraform-provider-nomad_v2.1.0_x5: 2024/01/31 21:00:09 [DEBUG] found CSI volume "tempo-data[0]" in namespace "c3-monitoring": timestamp="2024-01-31T21:00:09.685+0100"
module.soc_volumes.nomad_csi_volume.tempo_data[0]: Creation complete after 1s [id=tempo-data[0]]
2024-01-31T21:00:09.694+0100 [DEBUG] State storage *remote.State declined to persist a state snapshot
2024-01-31T21:00:09.696+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-31T21:00:09.701+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/nomad/2.1.0/linux_amd64/terraform-provider-nomad_v2.1.0_x5 pid=570893
2024-01-31T21:00:09.701+0100 [DEBUG] provider: plugin exited
2024-01-31T21:00:09.702+0100 [DEBUG] states/remote: state read serial is: 5; serial is: 5
2024-01-31T21:00:09.702+0100 [DEBUG] states/remote: state read lineage is: 8c27428e-cb98-acc6-d77b-7270b9794b11; lineage is: 8c27428e-cb98-acc6-d77b-7270b9794b11
```

</details>